MMMZZZZ/Random-Stuff/TI/TivaWare_C_Series-2.2.0.295/examples/boards/ek-tm4c129exl/aes128_cmac/aes128_cmac.c
//*****************************************************************************
//
// aes128_cmac.c - Simple AES128 CMAC demo.
//
// Copyright (c) 2013-2020 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 2.2.0.295 of the EK-TM4C129EXL Firmware Package.
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_aes.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "driverlib/aes.h"
#include "driverlib/debug.h"
#include "driverlib/interrupt.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "driverlib/udma.h"
#include "drivers/pinout.h"
#include "utils/uartstdio.h"

//*****************************************************************************
//
//! \addtogroup example_list
//! <h1>AES128 CMAC Demo (aes128_cmac)</h1>
//!
//! Simple demo showing an authentication operation using the AES128 module in
//! CMAC mode.  A series of test vectors are authenticated.
//!
//! This module is also capable of CBC-MAC mode, but this has been determined
//! to be insecure when using variable message lengths.  CMAC is now 
//! recommended instead by NIST.
//!
//! Please note that the use of interrupts and uDMA is not required for the
//! operation of the module.  It is only done for demonstration purposes.
//
//*****************************************************************************

//*****************************************************************************
//
// Configuration defines.
//
//*****************************************************************************
#define CCM_LOOP_TIMEOUT        500000

//*****************************************************************************
//
// The DMA control structure table.
//
//*****************************************************************************
#if defined(ewarm)
#pragma data_alignment=1024
tDMAControlTable g_psDMAControlTable[64];
#elif defined(ccs)
#pragma DATA_ALIGN(g_psDMAControlTable, 1024)
tDMAControlTable g_psDMAControlTable[64];
#else
tDMAControlTable g_psDMAControlTable[64] __attribute__((aligned(1024)));
#endif

//*****************************************************************************
//
// Test cases from the NIST SP 800-38B document.
// The data in these test cases have been modified to be in big endian 
// format as required by the AES module.  This was done to simplify writes
// and comparisons.  When operations need to be performed on the data, the
// endianness is swapped.
//
//*****************************************************************************
typedef struct AESTestVectorStruct
{
    uint32_t ui32Length;
    uint32_t pui32Message[16];
    uint32_t pui32Tag[4];
}
tAESCMACTestVector;

tAESCMACTestVector g_psAESCMACTestVectors[] =
{
    //
    // Test Case #1
    // Empty message check.  Since there is no message, it must be
    // padded with a one and 127 zeros.  Also, a zero cannot be
    // written into the length register in this mode, so we just 
    // write a 1 as the length to signify an incomplete block.
    // Any value from 1 to 15 would have worked in this case.
    // Incomplete blocks are XOR'd with subkey2 rather than subkey1.
    // 
    {
        1,
        { 0x00000080, 0x00000000, 0x00000000, 0x00000000 },
        { 0x29691dbb, 0x283759e9, 0x127da37f, 0x4667759b }
    },

    //
    // Test Case #2
    // This is the first complete block.  It is XOR'd with subkey1.
    //
    {
        16,
        { 0xe2bec16b, 0x969f402e, 0x117e3de9, 0x2a179373 },
        { 0xb4160a07, 0x44414d6b, 0x9ddd9bf7, 0x7c284ad0 }
    },
    
    //
    // Test Case #3
    // Since the message is not a multiple of 128 bits, there must
    // be padding appended to the end of the message.  This padding
    // is a one followed by 63 zeros.
    //
    {
        40,
        { 0xe2bec16b, 0x969f402e, 0x117e3de9, 0x2a179373,
          0x578a2dae, 0x9cac031e, 0xac6fb79e, 0x518eaf45,
          0x461cc830, 0x11e45ca3, 0x00000080, 0x00000000 },
        { 0x4767a6df, 0x30e69ade, 0x6132ca30, 0x27c89714 }
    },

    //
    // Test Case #4
    //
    {
        64,
        { 0xe2bec16b, 0x969f402e, 0x117e3de9, 0x2a179373,
          0x578a2dae, 0x9cac031e, 0xac6fb79e, 0x518eaf45,
          0x461cc830, 0x11e45ca3, 0x19c1fbe5, 0xef520a1a,
          0x45249ff6, 0x179b4fdf, 0x7b412bad, 0x10376ce6 },
        { 0xbfbef051, 0x929d3b7e, 0x177449fc, 0xfe3c3679 }
    }
};

//
// The following key is used for all of the above test cases.
//
uint32_t g_pui32AES128Key[4] =
{
    0x16157e2b, 0xa6d2ae28, 0x8815f7ab, 0x3c4fcf09
};

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif

//*****************************************************************************
//
// Round up length to nearest 16 byte boundary.  This is needed because all
// four data registers must be written at once.  This is handled in the AES
// driver, but if using uDMA, the length must rounded up.
//
//*****************************************************************************
uint32_t
LengthRoundUp(uint32_t ui32Length)
{
    uint32_t ui32Remainder;

    ui32Remainder = ui32Length % 16;
    if(ui32Remainder == 0)
    {
        return(ui32Length);
    }
    else
    {
        return(ui32Length + (16 - ui32Remainder));
    }
}

//*****************************************************************************
//
// Switch the endianness of the data array.
//
//*****************************************************************************
void
EndiannessSwap(uint32_t *pui32Input, uint32_t *pui32Output, 
              uint32_t ui32Length)
{
    uint32_t ui32Count;
    
    //
    // For each word, swap the endianness.
    //
    for(ui32Count = 0; ui32Count < ui32Length; ui32Count++)
    {
        pui32Output[ui32Count] = ((pui32Input[ui32Count] & 0x000000ff) << 24) |
                                 ((pui32Input[ui32Count] & 0x0000ff00) << 8) |
                                 ((pui32Input[ui32Count] & 0x00ff0000) >> 8) |
                                 ((pui32Input[ui32Count] & 0xff000000) >> 24);   

