MMMZZZZ/Random-Stuff/TI/TivaWare_C_Series-2.2.0.295/examples/boards/ek-tm4c129exl/aes128_cmac/aes128_cmac.c
    }
}

//*****************************************************************************
//
// The AES interrupt handler and interrupt flags.
//
//*****************************************************************************
static volatile bool g_bContextInIntFlag;
static volatile bool g_bDataInIntFlag;
static volatile bool g_bContextOutIntFlag;
static volatile bool g_bDataOutIntFlag;
static volatile bool g_bContextInDMADoneIntFlag;
static volatile bool g_bDataInDMADoneIntFlag;
static volatile bool g_bContextOutDMADoneIntFlag;
static volatile bool g_bDataOutDMADoneIntFlag;

void
AESIntHandler(void)
{
    uint32_t ui32IntStatus;

    //
    // Read the AES masked interrupt status.
    //
    ui32IntStatus = MAP_AESIntStatus(AES_BASE, true);

    //
    // Print a different message depending on the interrupt source.
    //
    if(ui32IntStatus & AES_INT_CONTEXT_IN)
    {
        MAP_AESIntDisable(AES_BASE, AES_INT_CONTEXT_IN);
        g_bContextInIntFlag = true;
        UARTprintf(" Context input registers are ready.\n");
    }
    if(ui32IntStatus & AES_INT_DATA_IN)
    {
        MAP_AESIntDisable(AES_BASE, AES_INT_DATA_IN);
        g_bDataInIntFlag = true;
        UARTprintf(" Data FIFO is ready to receive data.\n");
    }
    if(ui32IntStatus & AES_INT_CONTEXT_OUT)
    {
        MAP_AESIntDisable(AES_BASE, AES_INT_CONTEXT_OUT);
        g_bContextOutIntFlag = true;
        UARTprintf(" Context output registers are ready.\n");
    }
    if(ui32IntStatus & AES_INT_DATA_OUT)
    {
        MAP_AESIntDisable(AES_BASE, AES_INT_DATA_OUT);
        g_bDataOutIntFlag = true;
        UARTprintf(" Data FIFO is ready to provide data.\n");
    }
    if(ui32IntStatus & AES_INT_DMA_CONTEXT_IN)
    {
        MAP_AESIntClear(AES_BASE, AES_INT_DMA_CONTEXT_IN);
        g_bContextInDMADoneIntFlag = true;
        UARTprintf(" DMA completed a context write to the internal\n");
        UARTprintf(" registers.\n");
    }
    if(ui32IntStatus & AES_INT_DMA_DATA_IN)
    {
        MAP_AESIntClear(AES_BASE, AES_INT_DMA_DATA_IN);
        g_bDataInDMADoneIntFlag = true;
        UARTprintf(" DMA has written the last word of input data to\n");
        UARTprintf(" the internal FIFO of the engine.\n");
    }
    if(ui32IntStatus & AES_INT_DMA_CONTEXT_OUT)
    {
        MAP_AESIntClear(AES_BASE, AES_INT_DMA_CONTEXT_OUT);
        g_bContextOutDMADoneIntFlag = true;
        UARTprintf(" DMA completed the output context movement from\n");
        UARTprintf(" the internal registers.\n");
    }
    if(ui32IntStatus & AES_INT_DMA_DATA_OUT)
    {
        MAP_AESIntClear(AES_BASE, AES_INT_DMA_DATA_OUT);
        g_bDataOutDMADoneIntFlag = true;
        UARTprintf(" DMA has written the last word of process result.\n");
    }
}

//*****************************************************************************
//
// Perform an ECB encryption operation.
//
//*****************************************************************************
bool
AES128ECBEncrypt(uint32_t *pui32Src, uint32_t *pui32Dst, uint32_t *pui32Key,
                 uint32_t ui32Length)
{
    //
    // Perform a soft reset.
    //
    MAP_AESReset(AES_BASE);

    //
    // Configure the AES module.
    //
    MAP_AESConfigSet(AES_BASE, (AES_CFG_KEY_SIZE_128BIT | AES_CFG_DIR_ENCRYPT |
                                AES_CFG_MODE_ECB));

    //
    // Write the key.
    //
    MAP_AESKey1Set(AES_BASE, pui32Key, AES_CFG_KEY_SIZE_128BIT);

    //
    // Perform the encryption.
    //
    MAP_AESDataProcess(AES_BASE, pui32Src, pui32Dst, ui32Length);

    return(true);
}

//*****************************************************************************
//
// Generate a CMAC subkey.
//
//*****************************************************************************
bool
AES128CMACSubkeyGet(uint32_t *pui32Key, uint32_t *pui32Input, 
                    uint32_t *pui32Subkey)
{
    uint32_t pui32Output[4];
    uint32_t pui32SwappedInput[4];
    int32_t i32Idx;   
    bool bCarry;

    //
    // If the MSB of the input is 0, then the subkey is just left shifted.
    // If the MSB of the input is 1, then the subkey is left shifted and
    // XOR'd with a constant.  First swap the endianness to big endian
    // to make the math easier.
    //
    EndiannessSwap(pui32Input, pui32SwappedInput, 4);

    //
    // Shift each word in the 128 bits.  Make sure to carry the left
    // shifted bits.
    //
    bCarry = false;
    for(i32Idx = 3; i32Idx >= 0; i32Idx--)
    {
        //
        // Shift the word.
        //
        pui32Output[i32Idx] = pui32SwappedInput[i32Idx] << 1;

        //
        // If there was a carry from the previous word.
        //
        if(bCarry)
        {
            pui32Output[i32Idx] |= 0x1;
            bCarry = false;
        }

        //
        // Check to see if we need to carry to the next word.
        //
        if(pui32SwappedInput[i32Idx] & 0x80000000)
        {   
            bCarry = true;
        }
    }
   
    //
    // Swap the endianness back to little endian.
    //
    EndiannessSwap(pui32Output, pui32Subkey, 4);

    //
    // XOR in the Rb constant if the MSB is 1.
    //
    if(pui32SwappedInput[0] & 0x80000000)
    {
        pui32Subkey[3] ^= 0x87000000;
    }

    return true;
}

//*****************************************************************************
//
// Perform an encryption operation.
//
//*****************************************************************************
bool
AES128CMACAuth(uint32_t *pui32Src, uint32_t *pui32Key, uint32_t *pui32Tag, 
               uint32_t ui32Length, bool bUseDMA)
{
    uint32_t pui32Subkey1[4];
    uint32_t pui32Subkey2[4];
    uint32_t pui32Zero[4];
    uint32_t pui32EncZero[4];

    //
    // Perform a soft reset.
    //
    MAP_AESReset(AES_BASE);

    //
    // Clear the interrupt flags.
    //
    g_bContextInIntFlag = false;
    g_bDataInIntFlag = false;
    g_bContextOutIntFlag = false;
    g_bDataOutIntFlag = false;
    g_bContextInDMADoneIntFlag = false;
    g_bDataInDMADoneIntFlag = false;
    g_bContextOutDMADoneIntFlag = false;
    g_bDataOutDMADoneIntFlag = false;

    //
    // Calculate the first subkey.  First, encrypt a zero string.
    //
    pui32Zero[0] = 0x00000000;
    pui32Zero[1] = 0x00000000;
    pui32Zero[2] = 0x00000000;
    pui32Zero[3] = 0x00000000;

    //
    // Encrypt the zero string. 
    //
    AES128ECBEncrypt(pui32Zero, pui32EncZero, pui32Key, 16);

    //
    // Get the first subkey.
    //
    AES128CMACSubkeyGet(pui32Key, pui32EncZero, pui32Subkey1);

    //
    // Get the second subkey.
    //
    AES128CMACSubkeyGet(pui32Key, pui32Subkey1, pui32Subkey2);

    //
    // Enable all interrupts.
    //
    MAP_AESIntEnable(AES_BASE, (AES_INT_CONTEXT_IN | AES_INT_CONTEXT_OUT |
                                AES_INT_DATA_IN | AES_INT_DATA_OUT));

    //
    // Configure the AES module.
    //
    MAP_AESConfigSet(AES_BASE, (AES_CFG_KEY_SIZE_128BIT | AES_CFG_DIR_ENCRYPT |
                                AES_CFG_MODE_CBCMAC));

    //
    // Write the key.
    //
    MAP_AESKey1Set(AES_BASE, pui32Key, AES_CFG_KEY_SIZE_128BIT);

    //
    // Write the first subkey.
    //
    MAP_AESKey2Set(AES_BASE, pui32Subkey1, AES_CFG_KEY_SIZE_128BIT);

    //
    // Write the second subkey.
    //
    MAP_AESKey3Set(AES_BASE, pui32Subkey2);

    //
    // Write the IV with zeroes.
    //
    MAP_AESIVSet(AES_BASE, pui32Zero);

    //
    // Depending on the argument, perform the encryption
    // with or without uDMA.
    //
    if(bUseDMA)
    {
        //
        // Enable DMA interrupts.
        //
        MAP_AESIntEnable(AES_BASE, (AES_INT_DMA_CONTEXT_IN |
                                    AES_INT_DMA_DATA_IN |
                                    AES_INT_DMA_CONTEXT_OUT |
                                    AES_INT_DMA_DATA_OUT));

        //
        // Setup the DMA module to copy data in.
        //
        MAP_uDMAChannelAssign(UDMA_CH14_AES0DIN);
        MAP_uDMAChannelAttributeDisable(UDMA_CH14_AES0DIN,
                                        UDMA_ATTR_ALTSELECT |
                                        UDMA_ATTR_USEBURST |
                                        UDMA_ATTR_HIGH_PRIORITY |
                                        UDMA_ATTR_REQMASK);
        MAP_uDMAChannelControlSet(UDMA_CH14_AES0DIN | UDMA_PRI_SELECT,
                                  UDMA_SIZE_32 | UDMA_SRC_INC_32 |
                                  UDMA_DST_INC_NONE | UDMA_ARB_4 |
                                  UDMA_DST_PROT_PRIV);
        MAP_uDMAChannelTransferSet(UDMA_CH14_AES0DIN | UDMA_PRI_SELECT,
                                   UDMA_MODE_BASIC, (void *)pui32Src,
                                   (void *)(AES_BASE + AES_O_DATA_IN_0),
                                   LengthRoundUp(ui32Length) / 4);
        UARTprintf("Data in DMA request enabled.\n");

        //
        // Write the length registers to start the process.
        //
        MAP_AESLengthSet(AES_BASE, (uint64_t)ui32Length);
        
        //
        // Enable the DMA channel to start the transfer.  This must be done after
        // writing the length to prevent data from copying before the context is 
        // truly ready.
        // 
        MAP_uDMAChannelEnable(UDMA_CH14_AES0DIN);

        //
        // Enable DMA requests
        //
        MAP_AESDMAEnable(AES_BASE, AES_DMA_DATA_IN);

        //
        // Wait for the data in DMA done interrupt.
        //
        while(!g_bDataInDMADoneIntFlag)
        {
        }

        //
        // Read out the tag.
        //
        MAP_AESTagRead(AES_BASE, pui32Tag);
    }
    else
    {
        //
        // Perform the authentication.
        //
        MAP_AESDataAuth(AES_BASE, pui32Src, ui32Length, pui32Tag);
    }

    return(true);
}

//*****************************************************************************
//
// Initialize the AES and CCM modules.
//
//*****************************************************************************
bool
AESInit(void)
{
    uint32_t ui32Loop;

    //
    // Check that the CCM peripheral is present.
    //
    if(!MAP_SysCtlPeripheralPresent(SYSCTL_PERIPH_CCM0))
    {
        UARTprintf("No CCM peripheral found!\n");

        //
        // Return failure.
        //
        return(false);
    }

    //
    // The hardware is available, enable it.
    //
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_CCM0);

    //
    // Wait for the peripheral to be ready.
    //
    ui32Loop = 0;
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_CCM0))
    {
        //
        // Increment our poll counter.
        //
        ui32Loop++;

        if(ui32Loop > CCM_LOOP_TIMEOUT)
        {
            //
            // Timed out, notify and spin.
            //
            UARTprintf("Time out on CCM ready after enable.\n");

            //
            // Return failure.
            //
            return(false);
        }
    }

    //
    // Reset the peripheral to ensure we are starting from a known condition.
    //
    MAP_SysCtlPeripheralReset(SYSCTL_PERIPH_CCM0);

    //
    // Wait for the peripheral to be ready again.
    //
    ui32Loop = 0;
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_CCM0))
    {
        //
        // Increment our poll counter.
        //
        ui32Loop++;

        if(ui32Loop > CCM_LOOP_TIMEOUT)
        {
            //
            // Timed out, spin.
            //
            UARTprintf("Time out on CCM ready after reset.\n");

            //
            // Return failure.
            //
            return(false);
        }
    }

    //
    // Return initialization success.
    //
    return(true);
}

//*****************************************************************************
//
// Configure the UART and its pins.  This must be called before UARTprintf().
//
//*****************************************************************************
void
ConfigureUART(void)
{
    //
    // Enable UART0
    //
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);

    //
    // Use the internal 16MHz oscillator as the UART clock source.
    //
    MAP_UARTClockSourceSet(UART0_BASE, UART_CLOCK_PIOSC);

    //
    // Initialize the UART for console I/O.
    //
    UARTStdioConfig(0, 115200, 16000000);
}

//*****************************************************************************
//
// This example authenticates blocks of plaintext using AES128 in CMAC mode.  
// It does the encryption first without uDMA and then with uDMA.  The results
// are checked after each operation.
//
//*****************************************************************************
int
main(void)
{
    uint32_t *pui32ExpTag, *pui32Message;
    uint32_t ui32Errors, ui32Idx, ui32Length, pui32Tag[4], ui32SysClock;
    uint8_t ui8Vector;
    
    //
    // Run from the PLL at 120 MHz.
    // Note: SYSCTL_CFG_VCO_240 is a new setting provided in TivaWare 2.2.x and
    // later to better reflect the actual VCO speed due to SYSCTL#22.
    //
    ui32SysClock = MAP_SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |
                                           SYSCTL_OSC_MAIN |
                                           SYSCTL_USE_PLL |
                                           SYSCTL_CFG_VCO_240), 120000000);

    //
    // Configure the device pins.
    //
    PinoutSet(false, false);

    //
    // Initialize local variables.
    //
    ui32Errors = 0;
    for(ui32Idx = 0; ui32Idx < 4; ui32Idx++)
    {
        pui32Tag[ui32Idx] = 0;
    }

    //
    // Enable stacking for interrupt handlers.  This allows floating-point
    // instructions to be used within interrupt handlers, but at the expense of
    // extra stack usage.
    //
    MAP_FPUStackingEnable();

    //
    // Enable AES interrupts.
    //
    MAP_IntEnable(INT_AES0);

    //
    // Enable debug output on UART0 and print a welcome message.
    //
    ConfigureUART();
    UARTprintf("\033[2J\033[H");
    UARTprintf("Starting AES128 CMAC encryption demo.\n");
    
    //
    // Enable the uDMA module.
    //
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);

    //
    // Setup the control table.
    //
    MAP_uDMAEnable();
    MAP_uDMAControlBaseSet(g_psDMAControlTable);

    //
    // Initialize the CCM and AES modules.
    //
    if(!AESInit())
    {
        UARTprintf("Initialization of the AES module failed.\n");
        ui32Errors |= 0x00000001;
    }

    //
    // Loop through all the given vectors.
    //
    for(ui8Vector = 0;
        (ui8Vector < 
         (sizeof(g_psAESCMACTestVectors) / sizeof(g_psAESCMACTestVectors[0]))) &&
        (ui32Errors == 0);
        ui8Vector++)
    {
        UARTprintf("Starting vector #%d\n", ui8Vector);

        //
        // Get the current vector's data members.
        //
        ui32Length = g_psAESCMACTestVectors[ui8Vector].ui32Length;
        pui32Message = g_psAESCMACTestVectors[ui8Vector].pui32Message;
        pui32ExpTag = g_psAESCMACTestVectors[ui8Vector].pui32Tag;
        
        //
        // Perform the encryption without uDMA.
        //
        UARTprintf("Performing encryption without uDMA.\n");
        AES128CMACAuth(pui32Message, g_pui32AES128Key,
                       pui32Tag, ui32Length, false);

        //
        // Check the result.
        //
        for(ui32Idx = 0; ui32Idx < 4; ui32Idx++)
        {
            if(pui32Tag[ui32Idx] != pui32ExpTag[ui32Idx])
            {
                UARTprintf("Tag mismatch on word %d. Exp: 0x%x, Act: "
                           "0x%x\n", ui32Idx, pui32ExpTag[ui32Idx],
                           pui32Tag[ui32Idx]);
                ui32Errors |= (ui32Idx << 16) | 0x00000002;
            }
        }

        //
        // Clear the array containing the tag.
        //
        for(ui32Idx = 0; ui32Idx < 4; ui32Idx++)
        {
            pui32Tag[ui32Idx] = 0;
        }

        //
        // Only use DMA with the vectors that have data.
        //
        if(ui32Length != 0)
        {
            //
            // Perform the encryption with uDMA.
            //
            UARTprintf("Performing encryption with uDMA.\n");
            AES128CMACAuth(pui32Message, g_pui32AES128Key,
                           pui32Tag, ui32Length, true);

            //
            // Check the result.
            //
            for(ui32Idx = 0; ui32Idx < 4; ui32Idx++)
            {
                if(pui32Tag[ui32Idx] != pui32ExpTag[ui32Idx])
                {
                    UARTprintf("Tag mismatch on word %d. Exp: 0x%x, Act: "
                               "0x%x\n", ui32Idx, pui32ExpTag[ui32Idx],
                               pui32Tag[ui32Idx]);
                    ui32Errors |= (ui32Idx << 16) | 0x00000004;
                }
            }

            //
            // Clear the array containing the tag.
            //
            for(ui32Idx = 0; ui32Idx < 4; ui32Idx++)
            {
                pui32Tag[ui32Idx] = 0;
            }
        }
    }

    //
    // Finished.
    //
    if(ui32Errors)
    {
        UARTprintf("Demo failed with error code 0x%x.\n", ui32Errors);
        LEDWrite(CLP_D3 | CLP_D4, CLP_D4);
    }
    else
    {
        UARTprintf("Demo completed successfully.\n");
        LEDWrite(CLP_D3 | CLP_D4, CLP_D3);
        
    }

    while(1)
    {
    }
}
